000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/РаботаВыполняемаяСотрудниками/РаботаВыполняемаяСотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботаВыполняемаяСотрудниками</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>ОсновноеМестоРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РаботаВыполняемаяСотрудниками</name>
    <type>
      <types>CatalogRef.РаботаВыполняемаяСотрудниками</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/РаботаВыполняемаяСотрудниками/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда

	//	LNK 02.07.2017 16:43:26
		Возврат;

	КонецЕсли;
	
	Если Количество() > 0 тогда
		Для Каждого Строка из ЭтотОбъект цикл
				Если Строка.ОсновноеМестоРаботы тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	1 КАК Поле1
					|ИЗ
					|	РегистрСведений.РаботаВыполняемаяСотрудниками КАК Должности
					|ГДЕ
					|	Должности.Сотрудник = &Сотрудник
					|	И Должности.ОсновноеМестоРаботы = ИСТИНА";
				
				Запрос.УстановитьПараметр("Сотрудник", Отбор.Сотрудник.Значение);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				Если НЕ РезультатЗапроса.Пустой() тогда
					Отказ = Истина;
					Сообщить("У данного сотрудника уже есть основное место работы!");
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
